In [2]:
import pandas as pd
import numpy as np
c=pd.read_csv('/home/aj/Downloads/Titanic.csv')
print(c)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex    age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.00      0      0   24160  211.3375       B5        S    2
1       male   0.92      1      2  113781  151.5500  C22 C26        S   11
2     female   2.00      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.00      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.00      1      2  113781  151.5500  C22 C26        S  NaN
...      ...    ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.50      1      0    2665   14.4542      NaN        C  NaN
1305  female    NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.50      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.00      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.00      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [3]:
df = pd.DataFrame({ "Name": ["Mr. Harris", "Mr. William","Miss. Elizabeth"], "Age": [22, 35, 35], "Sex": ["male", "male", "female"], "Income" : [100, 220 , 75]} )

In [4]:
data = pd.DataFrame({ 'apples': [3, 2, 0, 1] , 'oranges': [0, 3, 7, 2]})

In [5]:
data

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [14]:
data.sum(axis=1)

0    3
1    5
2    7
3    3
dtype: int64

In [93]:
df = pd.DataFrame({ "Name": ["Hari", "Shyam","Reema", "Bhadur", "Robin", "Arti"], "Age": [22, 35, 58, 18, 42, 39], "Sex": ["male", "male", "female", "male", "male", "female" ], "Income" : [100, 220 , 75, 35, 125, 190], "Car" : [True, 'NaN' , True, False, True, False]} )

In [19]:
data['apples']

0    3
1    2
2    0
3    1
Name: apples, dtype: int64

In [22]:
df

     Name  Age     Sex  Income    Car
0    Hari   22    male     100   True
1   Shyam   35    male     220    NaN
2   Reema   58  female      75   True
3  Bhadur   18    male      35  False
4   Robin   42    male     125   True
5    Arti   39  female     190  False

In [29]:
df.loc[0:2,['Name','Age','Car']]

    Name  Age   Car
0   Hari   22  True
1  Shyam   35   NaN
2  Reema   58  True

In [35]:
df.iloc[0:3,0:4:2]

    Name     Sex
0   Hari    male
1  Shyam    male
2  Reema  female

In [42]:
c.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [45]:
c.head(5).isna()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,True,True,False
3,False,False,False,False,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,True,False

In [47]:
c.head(5).notna()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,True,True,True,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True,True,False,True
2,True,True,True,True,True,True,True,True,True,True,True,False,False,True
3,True,True,True,True,True,True,True,True,True,True,True,False,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,False,True

In [94]:
df[df.loc[0:2,'Income'].isna()]

/home/aj/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

In [13]:
df['Age'].mean()

38.333333333333336

In [49]:
df

     Name  Age     Sex  Income    Car
0    Hari   22    male     100   True
1   Shyam   35    male     220    NaN
2   Reema   58  female      75   True
3  Bhadur   18    male      35  False
4   Robin   42    male     125   True
5    Arti   39  female     190  False

In [50]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
df.columns

Index(['Name', 'Age', 'Sex', 'Income', 'Car'], dtype='object')

In [16]:
df.T

           0      1       2       3      4       5
Name    Hari  Shyam   Reema  Bhadur  Robin    Arti
Age       22     35      58      18     42      39
Sex     male   male  female    male   male  female
Income   100    220      75      35    125     190
Car     True    NaN    True   False   True   False

In [23]:
df.describe()

             Age      Income
count   6.000000    6.000000
mean   35.666667  124.166667
std    14.486776   69.958321
min    18.000000   35.000000
25%    25.250000   81.250000
50%    37.000000  112.500000
75%    41.250000  173.750000
max    58.000000  220.000000

In [51]:
df.sort_values(by=["Name","Sex"],ascending=False)

     Name  Age     Sex  Income    Car
1   Shyam   35    male     220    NaN
4   Robin   42    male     125   True
2   Reema   58  female      75   True
0    Hari   22    male     100   True
3  Bhadur   18    male      35  False
5    Arti   39  female     190  False

In [53]:
df.Age

0    22
1    35
2    58
3    18
4    42
5    39
Name: Age, dtype: int64

In [33]:
df["Age"]

0    22
1    35
2    58
3    18
4    42
5    39
Name: Age, dtype: int64

In [36]:
df[0:1]

   Name  Age   Sex  Income   Car
0  Hari   22  male     100  True

In [37]:
df.loc[0:2,['Age','Name']]

   Age   Name
0   22   Hari
1   35  Shyam
2   58  Reema

In [39]:
df.loc[1,['Age']]

Age    35
Name: 1, dtype: object

In [40]:
df.loc[3,'Age']

18

<b>loc based on name 

iloc based on position</b>

In [41]:
df.iloc[3]

Name      Bhadur
Age           18
Sex         male
Income        35
Car        False
Name: 3, dtype: object

In [42]:
df.iloc[3:5,2:4]

    Sex  Income
3  male      35
4  male     125

In [43]:
df.iloc[[1,2,3],2:3]

      Sex
1    male
2  female
3    male

In [46]:
df.iloc[:,2]

0      male
1      male
2    female
3      male
4      male
5    female
Name: Sex, dtype: object

In [57]:
df[df['Age']>30]

    Name  Age     Sex  Income    Car
1  Shyam   35    male     220    NaN
2  Reema   58  female      75   True
4  Robin   42    male     125   True
5   Arti   39  female     190  False

In [55]:
df['Age'].sum()

214

In [56]:
df.Age[1:2]

1    35
Name: Age, dtype: int64

In [59]:
df[(df['Age']>20)&(df['Car']==False)]

   Name  Age     Sex  Income    Car
5  Arti   39  female     190  False

In [10]:
df.iloc[:,:]

     Name  Age     Sex  Income    Car
0    Hari   22    male     100   True
1   Shyam   35    male     220    NaN
2   Reema   58  female      75   True
3  Bhadur   18    male      35  False
4   Robin   42    male     125   True
5    Arti   39  female     190  False

In [72]:
df.at[1,'Age']

35

In [15]:
df.iat[1,1]

35

In [19]:
df.loc[1,'Age']

35

In [74]:
df.loc[:,'Age']>30

0    False
1     True
2     True
3    False
4     True
5     True
Name: Age, dtype: bool

In [75]:
df[df['Car'].notna()]

     Name  Age     Sex  Income    Car
0    Hari   22    male     100   True
1   Shyam   35    male     220    NaN
2   Reema   58  female      75   True
3  Bhadur   18    male      35  False
4   Robin   42    male     125   True
5    Arti   39  female     190  False

In [25]:
df[df['Car'].isna()]

Empty DataFrame
Columns: [Name, Age, Sex, Income, Car]
Index: []

In [78]:
df['t']=df['Age']/df['Income']
df

     Name  Age     Sex  Income    Car         t
0    Hari   22    male     100   True  0.220000
1   Shyam   35    male     220    NaN  0.159091
2   Reema   58  female      75   True  0.773333
3  Bhadur   18    male      35  False  0.514286
4   Robin   42    male     125   True  0.336000
5    Arti   39  female     190  False  0.205263

In [79]:
df

     Name  Age     Sex  Income    Car         t
0    Hari   22    male     100   True  0.220000
1   Shyam   35    male     220    NaN  0.159091
2   Reema   58  female      75   True  0.773333
3  Bhadur   18    male      35  False  0.514286
4   Robin   42    male     125   True  0.336000
5    Arti   39  female     190  False  0.205263

In [80]:
df

     Name  Age     Sex  Income    Car         t
0    Hari   22    male     100   True  0.220000
1   Shyam   35    male     220    NaN  0.159091
2   Reema   58  female      75   True  0.773333
3  Bhadur   18    male      35  False  0.514286
4   Robin   42    male     125   True  0.336000
5    Arti   39  female     190  False  0.205263

In [81]:
df.insert(1,'new',df['t'])
df

     Name       new  Age     Sex  Income    Car         t
0    Hari  0.220000   22    male     100   True  0.220000
1   Shyam  0.159091   35    male     220    NaN  0.159091
2   Reema  0.773333   58  female      75   True  0.773333
3  Bhadur  0.514286   18    male      35  False  0.514286
4   Robin  0.336000   42    male     125   True  0.336000
5    Arti  0.205263   39  female     190  False  0.205263

In [82]:
df.pop('t')
df

     Name       new  Age     Sex  Income    Car
0    Hari  0.220000   22    male     100   True
1   Shyam  0.159091   35    male     220    NaN
2   Reema  0.773333   58  female      75   True
3  Bhadur  0.514286   18    male      35  False
4   Robin  0.336000   42    male     125   True
5    Arti  0.205263   39  female     190  False

In [84]:
df.groupby('Sex').sum()

             new  Age  Income
Sex
female  0.978596   97     265
male    1.229377  117     480

In [85]:
df.groupby('Sex')['Age','Income'].mean()

/home/aj/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

          Age  Income
Sex
female  48.50   132.5
male    29.25   120.0

In [14]:
df.groupby('Age')['Income'].mean()

Age
22    100
35    220
58     75
Name: Income, dtype: int64

In [86]:
df.groupby("Name")[["Age", "Income"]].mean()

        Age  Income
Name
Arti     39     190
Bhadur   18      35
Hari     22     100
Reema    58      75
Robin    42     125
Shyam    35     220

In [91]:
df["Age"].value_counts(bins =5)#dropna true, then nan is considered

(34.0, 42.0]      3
(17.959, 26.0]    2
(50.0, 58.0]      1
(42.0, 50.0]      0
(26.0, 34.0]      0
Name: Age, dtype: int64